app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-07-27 00:18:39.001962"], ["updated_at", "2018-07-27 00:18:39.001962"]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-07-27 00:18:39.008794"], ["updated_at", "2018-07-27 00:18:39.008794"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0])
      Artist.find_or_create_by(name: song[1])